function [ f ] = sinc_cm_model( x )
% ЭТА МОДЕЛЬ ЗАВЫШАЕТ ВЫСОТУ ГЛАВНОГО ПИКА ПРОЦЕНТОВ НА 10!!!
% В целом сделано для чернового варианта, при возможности переписать
% Область применимости- от -18 до 18 обратных см от пика
% В модель сувать обратные сантиметры иначе не булет работать
       a1 =      0.1681  ;
       b1 =     0.04201  ;
       c1 =       1.606  ;
       a2 =      0.2375  ;
       b2 =      0.3007  ;
       c2 =       1.555  ;
       a3 =      0.1966  ;
       b3 =      0.5375  ;
       c3 =        1.54  ;
       a4 =      0.1456  ;
       b4 =       0.146  ;
       c4 =       1.547  ;
       a5 =      0.1425  ;
       b5 =      0.7997  ;
       c5 =       1.532  ;
       a6 =   0.0008671  ;
       b6 =      0.9575  ;
       c6 =       3.197  ;
       a7 =     0.09712  ;
       b7 =       1.058  ;
       c7 =       1.551  ;
       a8 =     0.04616  ;
       b8 =       1.295  ;
       c8 =       1.625 ;
         f = a1*sin(b1*x+c1) + a2*sin(b2*x+c2) + a3*sin(b3*x+c3) + a4*sin(b4*x+c4) + a5*sin(b5*x+c5) + a6*sin(b6*x+c6) + a7*sin(b7*x+c7) + a8*sin(b8*x+c8);

end

